// components/about/MissionStatement.jsx
export default function MissionStatement() {
  return (
    <section className="w-full ">
      <h1 className="textNormal4">Почему именно WeldMart?</h1>
      <h1>
        Наша миссия — сделать поиск нужных вам товаров от самых надежных брендов
        в промышленности как можно проще. Мы постоянно добавляем новые продукты,
        и если вы не нашли то, что искали, свяжитесь с нами, и мы сделаем все
        возможное, чтобы вам помочь!
      </h1>
      <div className="mt-4 w-full flex justify-start flex-col items-start gap-3">
        <h1 className="textNormal4">Наша цель</h1>
        <p>
          быть ведущим онлайн-поставщиком сварочной продукции, предоставляя
          клиентам высококачественное оборудование и расходные материалы,
          соответствующие самым строгим стандартам. Мы стремимся обеспечить
          максимально удобный и безопасный процесс покупки, предлагая лучшие
          решения для профессионалов и домашних мастеров. Мы не просто продаем
          сварочную продукцию — мы создаем долгосрочные партнерские отношения,
          поддерживаем инновации и постоянное совершенствование нашего
          ассортимента.
        </p>
      </div>
    </section>
  );
}
