import React from "react";

export default function PrivacyPolicy() {
  return (
    <div className="max-w-4xl mx-auto p-6 bg-white shadow-lg rounded-lg mt-10">
      <h1 className="text-3xl font-bold text-center mb-6">
        Условия пользования сайтом и Политика конфиденциальности
      </h1>
      <p className="text-gray-700 mb-4">
        Добро пожаловать на сайт <span className="font-semibold">WELDMART</span>. Пожалуйста, внимательно ознакомьтесь с настоящими Условиями.
      </p>
      
      <h2 className="text-xl font-semibold mt-6 mb-2">1. Регистрация и заказ</h2>
      <p className="text-gray-700">
        Для оформления заказа на нашем сайте необходимо зарегистрироваться и указать актуальную информацию, включая имя, контактные данные и адрес доставки.
      </p>
      
      <h2 className="text-xl font-semibold mt-6 mb-2">2. Оплата и доставка</h2>
      <p className="text-gray-700">
        2.1. Мы предлагаем несколько простых способов оплаты: банковские карты, электронные кошельки и другие доступные методы, доступные на сайте. Все платежи осуществляются в узбекских суммах (UZS) или другой валюте.
      </p>
      <p className="text-gray-700">
        2.2. Стоимость доставки зависит от вашего местоположения и способа доставки. Точные условия будут указаны при оформлении заказа. Мы доставляем товары по всей территории Узбекистана.
      </p>
      <p className="text-gray-700">
        2.3. Ожидаемый срок доставки зависит от региона и наличия товара на складе. Мы делаем все возможное, чтобы ваша покупка была совершена в кратчайшие сроки.
      </p>
      
      <h2 className="text-xl font-semibold mt-6 mb-2">3. Ответственность</h2>
      <p className="text-gray-700">
        Мы гарантируем качество товара, а в случае несоответствия или брака товар будет заменен или возвращен.
      </p>
      
      <h2 className="text-xl font-semibold mt-6 mb-2">4. Интеллектуальная собственность</h2>
      <p className="text-gray-700">
        Все материалы, размещенные на сайте (включая текст, изображения, логотипы, видео, графику и другие элементы), являются интеллектуальной собственностью ООО “WELDMART” и защищены законом Республики Узбекистан об авторском праве.
      </p>
      
      <h2 className="text-xl font-semibold mt-6 mb-2">5. Применимое законодательство</h2>
      <p className="text-gray-700">
        Настоящие Условия регулируются требованиями Республики Узбекистан. В случае возникновения споров они будут разрешены в судебном порядке в соответствии с законодательством Республики Узбекистан.
      </p>
      
      <p className="text-center text-gray-700 font-semibold mt-6">
        Спасибо, что выбрали нас! Мы желаем вам удачных покупок, отличного настроения и качественного обслуживания!
      </p>
    </div>
  );
}
